Revit 2027 API
AreaReinforcement.Direction Property
 Retrieve the Major Direction of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; }
Public ReadOnly Property Direction As XYZ
	Get
public:
property XYZ^ Direction {
	XYZ^ get ();
}
member Direction : XYZ with get
Property Value
XYZ
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace